{
    "peft_type": "LORA", 
    "base_model_name_or_path": "facebook/opt-350m",
    "revision": null,
    "task_type": "CAUSAL_LM",
    "inference_mode": true,
    "layers_pattern": null,
    "layers_to_transform": null,
    "lora_alpha": 32,
    "lora_dropout": 0.05,
    "modules_to_save": null,
    "r": 16,
    "target_modules": [
      "q_proj", 
      "v_proj"
    ]
  }